app/controllers/ilmos_controller.rb

  def create
    @tournament = Tournament.find(params[:tournament_id])
    @player = Player.new(params[:player])
    @player.status = :waiting_approval

    if @tournament.team_game
      team_name = params[:team] ? params[:team][:name] : nil
      logger.info('searching for existing team with name: %s' % team_name)
      @team = Team.find_by_tournament_id_and_name(@tournament.id, team_name) || Team.new(params[:team])
    end

    if logged_in?
      # if user is logged in, we need only player alias (and team)
      @user = current_user

      if @tournament.team_game
        @team.tournament = @tournament
        @team.save
        @player.team = @team
      end

      @player.user = @user
      @player.tournament = @tournament
      @player.save
---
SELECT * FROM `tournaments` WHERE (`tournaments`.`id` = 1)
SELECT * FROM `teams` WHERE (`teams`.`tournament_id` = '12' AND `teams`.`name` = 'plaa') LIMIT 1
INSERT INTO `teams` (`name`, `created_at`, `updated_at`, `tournament_id`, `organization`) VALUES('sdf', '2010-02-14 01:32:39', '2010-02-14 01:32:39', 1, NULL)
INSERT INTO `players` (`created_at`, `updated_at`, `type`, `user_id`, `tournament_id`, `alias`, `team_id`) VALUES('2010-01-29 06:44:31', '2010-01-29 06:44:31', NULL, 14, 1, 'asd', NULL)
INSERT INTO `users` (`address`, `glasses`, `created_at`, `hair`, `updated_at`, `username`, `eyes`, `admin`, `phone`, `height`, `other_notes`, `last_name`, `password`, `first_name`) VALUES('', '', '2010-01-29 06:44:31', '', '2010-01-29 06:44:31', 'adsa', '', 0, 'asd', NULL, '', 'sa', '28d462a25e1af470232eaaa560aad698466f5a41', 'as')

      username = generate_username(params[:user][:last_name], params[:user][:first_name])
      passwd = generate_passwd(params[:player][:alias])
      @user = User.new(params[:user])
      logger.info("creating new user: #{@user.first_name} #{@user.last_name} (#{@player.alias}), username #{username}")
---
SELECT `users`.id FROM `users` WHERE (`users`.`username` = BINARY 'jaakko') LIMIT 1

        @user.save

        @calendar.user = @user
        @calendar.save
---
INSERT INTO `calendars` (`friday`, `created_at`, `misc`, `tuesday`, `wednesday`, `updated_at`, `monday`, `saturday`, `sunday`, `user_id`, `thursday`) VALUES('', '2010-01-29 05:13:53', '', '', '', '2010-01-29 05:13:53', '', '', '', 11, '')