app/controllers/ilmos_controller.rb

  def show
    @tournament = Tournament.find(params[:tournament_id])
---
SELECT * FROM `tournaments` WHERE (`tournaments`.`id` = 1)