app/controllers/players_controller.rb

SELECT * FROM `tournaments` WHERE (`tournaments`.`id` = 1)
---
  def index
    @tournament = Tournament.find(params[:tournament_id])