app/controllers/teams_controller.rb

  def index
    @teams = Team.all
---
SELECT * FROM `teams`