app/controllers/tournaments_controller.rb

  def show
    @tournament = Tournament.find(params[:id])
---
SELECT * FROM `tournaments` WHERE (`tournaments`.`id` = 1)

  def edit
    @tournament = Tournament.find(params[:id])
---
SELECT * FROM `tournaments` WHERE (`tournaments`.`id` = 1)

  def create
    @tournament = Tournament.new(params[:tournament])

    respond_to do |format|
      if @tournament.save
---
INSERT INTO `tournaments` (`start_date`, `team_game`, `created_at`, `title`, `app_deadline`, `updated_at`, `finish_date`) VALUES('2010-02-14', 0, '2010-02-14 01:23:22', 'sdfsdf', NULL, '2010-02-14 01:23:22', '2010-02-11')

  def update
    @tournament = Tournament.find(params[:id])

    respond_to do |format|
      if @tournament.update_attributes(params[:tournament])
---
SELECT * FROM `tournaments` WHERE (`tournaments`.`id` = 1)
UPDATE `tournaments` SET `updated_at` = '2010-02-14 01:23:39', `app_deadline` = '2010-02-14 01:23:00', `team_game` = 1 WHERE `id` = 1