app/controllers/users_controller.rb

INSERT INTO `users` (`address`, `glasses`, `created_at`, `hair`, `updated_at`, `username`, `eyes`, `admin`, `phone`, `height`, `other_notes`, `last_name`, `password`, `first_name`) VALUES('', '', '2010-02-13 23:07:20', '', '2010-02-13 23:07:20', 'jkolanki', '', 0, '', NULL, '', NULL, '62d99579419975b9a1c6f3e08bd46bd2b5142cde', NULL)
---
  def create
    @user = User.new(params[:user])
    if @user.save